In [1]:
import pandas as pd

obj = pd.Series([4, 7, -5, 3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [15]:
import pandas as pd

temperature = pd.Series([22, 25, 19, 24], index=['Mon', 'Tue', 'Wed', 'Thu'])
print(temperature)

Mon    22
Tue    25
Wed    19
Thu    24
dtype: int64

In [17]:
print(temperature['Wed'])

19

In [19]:
population_data = {'Portugal': 10_300_300, 'Spain': 47_000_000, 'France': 67_000_0000}
population = pd.Series(population_data, index=['Portugal', 'Spain', 'Italy'])
print(population)

Portugal    10300300.0
Spain       47000000.0
Italy              NaN
dtype: float64

In [25]:
cidades = {
    'state': ['Lisboa', 'Porto', 'Lisboa', 'Porto'],
    'year': [2010, 2010, 2020, 2020],
    'pop': [5.50, 2.40, 5.05, 2.30]
}

df = pd.DataFrame(cidades)
print(df)

    state  year   pop
0  Lisboa  2010  5.50
1   Porto  2010  2.40
2  Lisboa  2020  5.05
3   Porto  2020  2.30

In [27]:
df['pop']

0    5.50
1    2.40
2    5.05
3    2.30
Name: pop, dtype: float64

In [31]:
df[df['year'] == 2020]

    state  year   pop
2  Lisboa  2020  5.05
3   Porto  2020  2.30

In [57]:
dados = pd.Series([100, 200, 300], index=['Portugal', 'Espanha', 'França'])

Portugal    100
Espanha     200
França      300
dtype: int64

In [67]:
dados2 = dados.reindex(['Portugal', 'França', 'Itália', 'Alemanha'])
print(dados2)

Portugal    100.0
França      300.0
Itália        NaN
Alemanha      NaN
dtype: float64

In [71]:
dados3 = dados2.reindex(['Portugal', 'França', 'Itália', 'Alemanha'], method='ffill')
print(dados3)

Portugal    100.0
França      300.0
Itália        NaN
Alemanha      NaN
dtype: float64

In [79]:
data = {
    'nome': ['Ana', 'Bruno', 'Carlos', 'Diana'],
    'idade': [23, 35, 45, 29],
    'salário': [1200, 2500, 4000, 2300]
}

df = pd.DataFrame(data)
df

     nome  idade  salário
0     Ana     23     1200
1   Bruno     35     2500
2  Carlos     45     4000
3   Diana     29     2300

In [85]:
df.drop(2)

    nome  idade  salário
0    Ana     23     1200
1  Bruno     35     2500
3  Diana     29     2300

In [95]:
df['dobro_salario'] = df['salário'] * 2
df

     nome  idade  salário  dobro_salario
0     Ana     23     1200           2400
1   Bruno     35     2500           5000
2  Carlos     45     4000           8000
3   Diana     29     2300           4600

In [107]:
df[(df['idade'] > 30) & (df['salário'] < 3000)]

    nome  idade  salário  dobro_salario
1  Bruno     35     2500           5000

In [115]:
import numpy as np 
import pandas as pd 

data = {
    'poeta': ['Eliot', 'Frost', 'Milton', 'Wordsworth'],
    'ano_nascimento': [1888, 1874, np.nan, 1770],
    'obra_principal': ['Four Quartets', 'The Road not taken', 'Paradise Lost', np.nan, ]
}

df = pd.DataFrame(data)
df

        poeta  ano_nascimento      obra_principal
0       Eliot          1888.0       Four Quartets
1       Frost          1874.0  The Road not taken
2      Milton             NaN       Paradise Lost
3  Wordsworth          1770.0                 NaN

In [140]:
df_limpo = df.copy()
df_limpo

        poeta  ano_nascimento      obra_principal
0       Eliot          1888.0       Four Quartets
1       Frost          1874.0  The Road not taken
2      Milton             NaN       Paradise Lost
3  Wordsworth          1770.0                 NaN

In [142]:
df_limpo.isna()

   poeta  ano_nascimento  obra_principal
0  False           False           False
1  False           False           False
2  False            True           False
3  False           False            True

In [144]:
df_limpo.dropna(how='all')

        poeta  ano_nascimento      obra_principal
0       Eliot          1888.0       Four Quartets
1       Frost          1874.0  The Road not taken
2      Milton             NaN       Paradise Lost
3  Wordsworth          1770.0                 NaN

In [163]:
df_limpo['ano_nascimento'] = df_limpo['ano_nascimento'].fillna(1608)

In [165]:
df_limpo['obra_principal'] = df_limpo['obra_principal'].fillna('I wandered lonely as a cloud')

In [167]:
df_limpo

        poeta  ano_nascimento                obra_principal
0       Eliot          1888.0                 Four Quartets
1       Frost          1874.0            The Road not taken
2      Milton          1608.0                 Paradise Lost
3  Wordsworth          1770.0  I wandered lonely as a cloud

In [175]:
df_limpo.dtypes

poeta              object
ano_nascimento    float64
obra_principal     object
dtype: object

In [177]:
df_limpo['ano_nascimento'] = df_limpo['ano_nascimento'].astype(int)

In [179]:
df_limpo

        poeta  ano_nascimento                obra_principal
0       Eliot            1888                 Four Quartets
1       Frost            1874            The Road not taken
2      Milton            1608                 Paradise Lost
3  Wordsworth            1770  I wandered lonely as a cloud

In [181]:
import pandas as pd

s1 = pd.Series([1, 2, 3], index=['Eliot', 'Frost', 'Milton'])
s2 = pd.Series([4, 5, 6, 7], index=['Milton', 'Frost', 'Wordsworth', 'Coleridge'])

s1 + s2

Coleridge     NaN
Eliot         NaN
Frost         7.0
Milton        7.0
Wordsworth    NaN
dtype: float64

In [183]:
livros_1900s = pd.Series([4, 3], index=['Eliot', 'Frost'])
livros_1800s = pd.Series([2, 5], index=['Wordsworth', 'Frost'])

In [185]:
livros_1900s + livros_1800s

Eliot         NaN
Frost         8.0
Wordsworth    NaN
dtype: float64

In [187]:
livros_1900s.add(livros_1800s, fill_value=0)

Eliot         4.0
Frost         8.0
Wordsworth    2.0
dtype: float64

In [191]:
poetas = pd.Series(['Eliot', 'Frost', 'Milton', 'Coleridge'])

poetas.map(str.upper)

0        ELIOT
1        FROST
2       MILTON
3    COLERIDGE
dtype: object

In [196]:
poetas.map({'Eliot': 'T. S. Eliot', 'Frost': 'Robert Frost'})

0     T. S. Eliot
1    Robert Frost
2             NaN
3             NaN
dtype: object

In [200]:
# Exercício 8 

data = {
    'Poeta': ['Eliot', 'Frost', 'Milton'],
    'idade_morte': [76, 88, 65],
    'obras': [12, 20, 8]
}

df = pd.DataFrame(data)
df

    Poeta  idade_morte  obras
0   Eliot           76     12
1   Frost           88     20
2  Milton           65      8

In [208]:
df[['idade_morte', 'obras']].apply(np.mean)

idade_morte    76.333333
obras          13.333333
dtype: float64

In [216]:
df['produtividade'] = df['obras'] / df['idade_morte']
df

    Poeta  idade_morte  obras  produtividade
0   Eliot           76     12       0.157895
1   Frost           88     20       0.227273
2  Milton           65      8       0.123077

In [228]:
df['Poeta'].map({'Eliot': 'Sr. Eliot', 'Frost': 'Sr. Frost', 'Milton': 'Sr. Milton'})

0     Sr. Eliot
1     Sr. Frost
2    Sr. Milton
Name: Poeta, dtype: object

In [238]:
df.sort_values('produtividade', ascending=False)

    Poeta  idade_morte  obras  produtividade
1   Frost           88     20       0.227273
0   Eliot           76     12       0.157895
2  Milton           65      8       0.123077

In [240]:
df.sort_values('obras', ascending=False)

    Poeta  idade_morte  obras  produtividade
1   Frost           88     20       0.227273
0   Eliot           76     12       0.157895
2  Milton           65      8       0.123077

In [272]:
df['ranking'] = df['produtividade'].rank(ascending=False)
df = df.sort_values('ranking')
df

    Poeta  idade_morte  obras  produtividade  ranking
1   Frost           88     20       0.227273      1.0
0   Eliot           76     12       0.157895      2.0
2  Milton           65      8       0.123077      3.0

In [276]:
# Exercício 10

df = pd.DataFrame({
    'Poeta': ['Thomas Stearns Eliot', 'Robert Frost', 'John Milton', 'William Wordsworth']
})

df

                  Poeta
0  Thomas Stearns Eliot
1          Robert Frost
2           John Milton
3    William Wordsworth

In [280]:
df['primeiro_nome'] = df['Poeta'].str.split().str[0]
df

                  Poeta primeiro_nome
0  Thomas Stearns Eliot        Thomas
1          Robert Frost        Robert
2           John Milton          John
3    William Wordsworth       William

In [288]:
df['tem_s'] = df['Poeta'].str.contains('s')
df

                  Poeta primeiro_nome  tem_s
0  Thomas Stearns Eliot        Thomas   True
1          Robert Frost        Robert   True
2           John Milton          John  False
3    William Wordsworth       William   True

In [290]:
df['Poeta'].str.replace('William', 'W.')

0    Thomas Stearns Eliot
1            Robert Frost
2             John Milton
3           W. Wordsworth
Name: Poeta, dtype: object